IRP/src/Documents/JournalEntry/JournalEntry.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>JournalEntry</name>
  <posting>Deny</posting>
  <registerRecords>AccountingRegister.Basic</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>LedgerType</name>
    <type>
      <types>CatalogRef.LedgerTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Basis</name>
    <type>
      <types>DocumentRef.PurchaseInvoice</types>
      <types>DocumentRef.BankPayment</types>
      <types>DocumentRef.RetailSalesReceipt</types>
      <types>DocumentRef.BankReceipt</types>
      <types>DocumentRef.SalesInvoice</types>
      <types>DocumentRef.ForeignCurrencyRevaluation</types>
      <types>DocumentRef.CashExpense</types>
      <types>DocumentRef.CashPayment</types>
      <types>DocumentRef.CashReceipt</types>
      <types>DocumentRef.CashRevenue</types>
      <types>DocumentRef.CreditNote</types>
      <types>DocumentRef.DebitNote</types>
    </type>
  </attributes>
  <attributes>
    <name>UserDefined</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Totals</name>
    <attributes>
      <name>ChartOfAccount</name>
      <type>
        <types>ChartOfAccountsRef.Basic</types>
      </type>
    </attributes>
    <attributes>
      <name>AmountDr</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>AmountCr</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Errors</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Operation</name>
      <type>
        <types>CatalogRef.AccountingOperations</types>
      </type>
    </attributes>
    <attributes>
      <name>ErrorDescription</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Documents/JournalEntry/Forms/SelectLedgerType/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	If Parameters.Property("MultipleDocuments") And Parameters.MultipleDocuments Then
		ThisObject.IsMultipleDocuments = True;
		For Each LedgerType In Parameters.ArrayOfLedgerTypes Do
			NewRow = ThisObject.JournalEntries.Add();
			NewRow.LedgerType   = LedgerType;
		EndDo;
		
		Items.JournalEntriesUse.Visible = True;
		Items.JournalEntriesJournalEntry.Visible = False;
		
	Else
		For Each Row In Parameters.ArrayOfJournalEntries Do
			NewRow = ThisObject.JournalEntries.Add();
			NewRow.JournalEntry = Row.JournalEntry;
			NewRow.LedgerType   = Row.LedgerType;
			NewRow.Icon = Not ValueIsFilled(Row.JournalEntry);
		EndDo;
		
		Items.JournalEntriesUse.Visible = False;
		Items.JournalEntriesJournalEntry.Visible = True;
		
	EndIf;
EndProcedure

&AtClient
Procedure Ok(Command)
	If ThisObject.IsMultipleDocuments Then
		ArrayOfLedgerTypes = New Array();
		For Each Row In JournalEntries Do
			If Row.Use Then
				ArrayOfLedgerTypes.Add(Row.LedgerType);
			EndIf;
		EndDo;
		
		If ArrayOfLedgerTypes.Count() > 0 Then
			Close(New Structure("ArrayOfLedgerTypes", ArrayOfLedgerTypes));
		Else
			Close(Undefined);
		EndIf;
	Else
		CloseAndReturnResult();
	EndIf;
EndProcedure

&AtClient
Procedure JournalEntriesSelection(Item, RowSelected, Field, StandardProcessing)
	If Not ThisObject.IsMultipleDocuments Then
		CloseAndReturnResult();
	EndIf;
EndProcedure

&AtClient
Procedure CloseAndReturnResult()
	CurrentData = Items.JournalEntries.CurrentData;
	If CurrentData = Undefined Then
		Close(Undefined);
		Return;
	EndIf;
	
	Result = New Structure();
	Result.Insert("JournalEntryRef" , CurrentData.JournalEntry); 
	Result.Insert("LedgerTypeRef"   , CurrentData.LedgerType);
	Close(Result);
EndProcedure

&AtClient
Procedure Cancel(Command)
	Close(Undefined);
EndProcedure

&AtClient
Procedure JournalEntriesBeforeAddRow(Item, Cancel, Clone, Parent, IsFolder, Parameter)
	Cancel = True;
EndProcedure

&AtClient
Procedure JournalEntriesBeforeDeleteRow(Item, Cancel)
	Cancel = True;
EndProcedure
